{"_id":{"$oid":"6154179a8fc0aeb45bdf98a1"},"Description":"Moonlight is a 2016 American coming-of-age drama film written and directed by Barry Jenkins, based on Tarell Alvin McCraney's unpublished semi-autobiographical play In Moonlight Black Boys Look Blue. It stars Trevante Rhodes, André Holland, Janelle Monáe, Ashton Sanders, Jharrel Jerome, Naomie Harris, and Mahershala Ali. The film presents three stages in the life of the main character: his childhood, adolescence, and early adult life. It explores the difficulties he faces with his sexuality and identity, including the physical and emotional abuse he endures growing up. Filmed in Miami, Florida, beginning in 2015, Moonlight premiered at the Telluride Film Festival on September 2, 2016. It was released in the United States on October 21, 2016 by A24, receiving universal acclaim and grossing over $65 million worldwide.","Genre":{"Name":"Coming-of-age","Description":"Coming-of-age films focus on the psychological and moral growth or transition of a protagonist from youth to adulthood. Personal growth and change is an important characteristic of this genre, which relies on dialogue and emotional responses, rather than action. The story is sometimes told in the form of a flashback.[1] Historically, coming-of-age films usually centred on young boys, although coming-of-age films focusing on girls have become more common in the early 21st century, such as The Poker House (2008), Winter's Bone (2010), Hick (2011), Girlhood (2014), Mustang (2015), The Diary of a Teenage Girl (2015), Mistress America (2015), The Edge of Seventeen (2016), Lady Bird (2017), Sweet 20 (2017).."},"Director":{"Name":"Barry Jenkins","Bio":"Barry Jenkins was born on November 19, 1979 in Miami, Florida, USA. He is a producer and director, known for If Beale Street Could Talk (2018), Moonlight (2016) and Medicine for Melancholy (2008).","Birth":"1986"},"ImagePath":"https://prod-lensculture-photos.s3.amazonaws.com/original/ae84aee7-d46e-486b-b56b-7efe30f3bf1a.jpg","Featured":true,"Name":["Moonlight."]}
{"_id":{"$oid":"61541fd38fc0aeb45bdf98a2"},"Title":"Hidden Figures","Description":" The story of a team of female African-American mathematicians who served a vital role in NASA during the early years of the U.S. space program.","Genre":{"Name":"Historical Drama","Description":" A historical drama (also period drama, costume drama, and period piece) is a work set in a past time period, usually used in the context of film and television. Historical drama includes Historical Drama and romances, adventure films, and swashbucklers. A period piece may be set in a vague or general era such as the Middle Ages or a specific period such as the Roaring Twenties."},"Director":{"Name":"Theodore Melfi","Bio":"Theodore Melfi was born on October 27, 1970 in Brooklyn, New York, USA as Theodore Michael Melfi. He is a producer and director, known for Hidden Figures (2016), St. Vincent (2014) and Huck. He is married to Kimberly Quinn.","Birth":"1970"},"ImagePath":"https://prod-lensculture-photos.s3.amazonaws.com/original/ae84aee7-d46e-486b-b56b-7efe30f3bf1a.jpg","Featured":false}
{"_id":{"$oid":"615423d176df2b4139653db9"},"Title":"Do the Right Thing","Description":" On the hottest day of the year on a street in the Bedford-Stuyvesant section of Brooklyn, everyone’s hate and bigotry smolders and builds until it explodes into violence.","Genre":{"Name":"Comedy Drama","Description":"This category consists of movies that contain elements of comedy films, in addition to being a drama. Comedy (from the Greek: κωμῳδία, kōmōdía) is a genre of fiction that consists of discourses or works intended to be humorous or amusing by inducing laughter, especially in theatre, film, stand-up comedy, television, radio, books, or any other entertainment medium. Drama is the specific mode of fiction represented in performance: a play, opera, mime, ballet, etc., performed in a theatre, or on radio or television."},"Director":{"Name":"Spike Lee","Bio":"Spike Lee's work has continually explored race relations, colorism in the black community, the role of media in contemporary life, urban crime and poverty, and other political issues. He has won numerous accolades for his work, including an Academy Award for Best Adapted Screenplay, a Student Academy Award, a BAFTA Award for Best Adapted Screenplay, two Emmy Awards, two Peabody Awards, and the Cannes Grand Prix. He has also received an Academy Honorary Award, an Honorary BAFTA Award, an Honorary César, and the Dorothy and Lillian Gish Prize. Lee's films Do the Right Thing, Malcolm X, 4 Little Girls and She's Gotta Have It were each selected by the Library of Congress for preservation in the National Film Registry for being culturally, historically, or aesthetically significant.","Birth":"1957"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/0/03/Do_the_Right_Thing_poster.png","Featured":false}
{"_id":{"$oid":"615424f076df2b4139653dba"},"Title":"Poetic Justice","Description":"Grieving hairdresser Justice goes on road trip from South Central Los Angeles to Oakland on a mail truck alongside her friend and a postal worker which she cannot stand","Genre":{"Name":"Romance","Description":" Romance films or romance movies are romantic love stories recorded in visual media for broadcast in theaters and on TV that focus on passion, emotion, and the affectionate romantic involvement of the main characters and the journey that their love takes them through dating, courtship or marriage."},"Director":{"Name":"John Singleton","Bio":" Son of Danny Singleton, a mortgage broker, and Sheila Ward, a pharmaceutical company sales executive, and raised in separate households by his unmarried parents, John Singleton attended the Film Writing Program at USC, after graduating from high school in 1986. While studying there, he won three writing awards from the university, which led to a contract with Creative Artists Agency during his sophomore year. Columbia Pictures bought his script for Boyz n the Hood (1991) and budgeted it at $7 million. Singleton noted that much of the story comes from his own experiences in South Central LA and credited his parents with keeping him off the street.","Birth":"1968","Death":"2019"},"ImagePath":"https://dkanut5j171nq.cloudfront.net/catalogue-images/ti108004.jpg","Featured":false}
{"_id":{"$oid":"615425e076df2b4139653dbb"},"Title":"Waiting to Exhale","Description":"Based on Terry McMillan's novel, this film follows four very different African-American women and their relationships with men.","Genre":{"Name":"Romance","Description":"Romance films or romance movies are romantic love stories recorded in visual media for broadcast in theaters and on TV that focus on passion, emotion, and the affectionate romantic involvement of the main characters and the journey that their love takes them through dating, courtship or marriage."},"Director":{"Name":"Forest Whitaker","Bio":"Forest Whitaker was born on July 15, 1961 in Longview, Texas, to Laura Francis (Smith), a special education teacher, and Forest Steven Whitaker, an insurance salesman. His family moved to South Central Los Angeles in 1965. The athletically-inclined Whitaker initially found his way into college via a football scholarship. Later, however, he transferred to USC where he set his concentration on music and earned two more scholarships training as an operatic tenor. This, in turn, led to another scholarship at Berkeley with a renewed focus on acting and the performing stage.","Birth":"1968"},"ImagePath":" https://upload.wikimedia.org/wikipedia/en/c/ca/WaitingExhale.jpg","Featured":false}
{"_id":{"$oid":"615426f676df2b4139653dbc"},"Title":"Daughters of the Dust","Description":"Languid look at the Gullah culture of the sea islands off the coast of South Carolina and Georgia where African folk-ways were maintained well into the 20th Century and was one of the last bastions of these mores in America. Set in 1902.","Genre":{"Name":"Historical Drama","Description":" A historical drama (also period drama, costume drama, and period piece) is a work set in a past time period, usually used in the context of film and television. Historical drama includes Historical Drama and romances, adventure films, and swashbucklers. A period piece may be set in a vague or general era such as the Middle Ages or a specific period such as the Roaring Twenties."},"Director":{"Name":"Julie Dash","Bio":" Julie Dash was born on October 22, 1952 in Queens, New York, USA. She is a director and writer, known for Daughters of the Dust (1991), Ride to Freedom: The Rosa Parks Story (2002) and Funny Valentines (1999).","Birth":"1952"},"ImagePath":" https://www2.bfi.org.uk/sites/bfi.org.uk/files/styles/full/public/image/daughter-of-the-dust-1991-002-women-under-parasol-on-beach-full-shot.jpg?itok=E60vu7k-","Featured":false}
{"_id":{"$oid":"615427ea76df2b4139653dbd"},"Title":"Pariah","Description":"A Brooklyn teenager juggles conflicting identities and risks friendship, heartbreak, and family in a desperate search for sexual expression.","Genre":{"Name":"Historical Drama","Description":"Coming-of-age films focus on the psychological and moral growth or transition of a protagonist from youth to adulthood. Personal growth and change is an important characteristic of this genre, which relies on dialogue and emotional responses, rather than action. The story is sometimes told in the form of a flashback.[1] Historically, coming-of-age films usually centred on young boys, although coming-of-age films focusing on girls have become more common in the early 21st century, such as The Poker House (2008), Winter's Bone (2010), Hick (2011), Girlhood (2014), Mustang (2015), The Diary of a Teenage Girl (2015), Mistress America (2015), The Edge of Seventeen (2016), Lady Bird (2017), Sweet 20 (2017)."},"Director":{"Name":"Dee Rees","Bio":"Writer/Director Dee Rees is an alumna of New York University's graduate film program and a Sundance Screenwriting & Directing Lab Fellow. In 2018, Dee became the first Black woman nominated for an Oscar in the Best Adapted Screenplay category for her highly-acclaimed film Mudbound (2017). The film, starring Jason Mitchell, Carey Mulligan and Mary J. Blige, tells the story of two men returning home from World War II, struggling to deal with racism and post-war life and was nominated for four Oscars, two Golden Globes, and received over 100 nominations between 2017 and 2018.","Birth":"1977"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/4/4f/Pariah_FilmPoster.jpeg","Featured":false}
{"_id":{"$oid":"6154292476df2b4139653dbe"},"Title":"Black Panther","Description":"T'Challa, heir to the hidden but advanced kingdom of Wakanda, must step forward to lead his people into a new future and must confront a challenger from his country''s past.","Genre":{"Name":"Superhero","Description":" A superhero film (or superhero movie) is a film that focuses on the actions of superheroes: individuals who usually possess extraordinary – generally superhuman – abilities and are dedicated to protecting the public. These films typically feature action, adventure, fantasy or science fiction elements, with the first film of a particular character often including a focus on the origin of their special powers and their first confrontation with their most famous supervillain or archenemy."},"Director":{"Name":"Ryan Coogler","Bio":" Ryan Coogler was born on May 23, 1986 in Oakland, California, USA as Ryan Kyle Coogler. He is a producer and director, known for Black Panther (2018), Creed (2015) and Fruitvale Station (2013). He has been married to Zinzi Coogler since 2016.","Birth":"1986"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/d/d6/Black_Panther_%28film%29_poster.jpg","Featured":false}
{"_id":{"$oid":"61542a4d76df2b4139653dbf"},"Title":"Beasts of the Southern Wild","Description":"Faced with both her hot-tempered father''s fading health and melting ice-caps that flood her ramshackle bayou community and unleash ancient aurochs, six-year-old Hushpuppy must learn the ways of courage and love.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds. The genre is considered a form of speculative fiction alongside science fiction films and horror films, although the genres do overlap.[1] Fantasy films often have an element of magic, myth, wonder, escapism, and the extraordinary.[2] Prevalent elements include fairies, angels, mermaids, witches, monsters, wizards, unicorns, dragons, talking animals, ogres, elves, trolls, white magic, gnomes, vampires, werewolves, ghosts, dwarves, giants, goblins, anthropomorphic or magical objects, familiars, curses and other enchantments, worlds involving magic, and the Middle Ages."},"Director":{"Name":"Benh Zeitlin","Bio":"Born in New York City and raised in Sunnyside, Queens and then Westchester County, Benh Zeitlin began his career as a film-maker at the tender age of 6 years when he and a friend made a Batman movie. He continued making films as a child before attending Wesleyan University, where he majored in film. After graduation, Benh spent a summer in Prague working with a prominent animation artist. Returning to the U.S., he worked in a private school in Manhattan helping elementary students create short films.","Birth":"1982"},"ImagePath":" https://m.media-amazon.com/images/M/MV5BMTQ3NDM1NTcyNl5BMl5BanBnXkFtZTcwOTg5NDM5Nw@@._V1_.jpg","Featured":false}
{"_id":{"$oid":"61542b7476df2b4139653dc0"},"Title":"Sorry to Bother You","Description":" In an alternate present-day version of Oakland, telemarketer Cassius Green discovers a magical key to professional success, propelling him into a universe of greed.","Genre":{"Name":"Comedy","Description":"This category consists of movies that contain elements of comedy films, in addition to being a drama. Comedy (from the Greek: κωμῳδία, kōmōdía) is a genre of fiction that consists of discourses or works intended to be humorous or amusing by inducing laughter, especially in theatre, film, stand-up comedy, television, radio, books, or any other entertainment medium. Drama is the specific mode of fiction represented in performance: a play, opera, mime, ballet, etc., performed in a theatre, or on radio or television."},"Director":{"Name":"Boots Riley","Bio":"Boots Riley was born on April 1, 1971 in Chicago, Illinois, USA as Raymond Lawrence Riley. He is a writer and director, known for Sorry to Bother You (2018), The Losers (2010) and Superbad (2007).","Birth":"1982"},"ImagePath":" https://upload.wikimedia.org/wikipedia/en/c/c7/Sorry_to_Bother_You.png","Featured":false}
{"_id":{"$oid":"61542c5b76df2b4139653dc1"},"Title":"Chi-Raq","Description":"Chi-Raq (/ʃaɪˈræk/) is a 2015 American musical crime comedy drama film, directed and produced by Spike Lee and co-written by Lee and Kevin Willmott. Set in Chicago, the film focuses on the gang violence prevalent in neighborhoods on the city's south side, particularly the Englewood neighborhood.","Genre":{"Name":"Comedy Drama","Description":"This category consists of movies that contain elements of comedy films, in addition to being a drama. Comedy (from the Greek: κωμῳδία, kōmōdía) is a genre of fiction that consists of discourses or works intended to be humorous or amusing by inducing laughter, especially in theatre, film, stand-up comedy, television, radio, books, or any other entertainment medium. Drama is the specific mode of fiction represented in performance: a play, opera, mime, ballet, etc., performed in a theatre, or on radio or television."},"Director":{"Name":"Spike Lee","Bio":"Spike Lee's work has continually explored race relations, colorism in the black community, the role of media in contemporary life, urban crime and poverty, and other political issues. He has won numerous accolades for his work, including an Academy Award for Best Adapted Screenplay, a Student Academy Award, a BAFTA Award for Best Adapted Screenplay, two Emmy Awards, two Peabody Awards, and the Cannes Grand Prix. He has also received an Academy Honorary Award, an Honorary BAFTA Award, an Honorary César, and the Dorothy and Lillian Gish Prize. Lee's films Do the Right Thing, Malcolm X, 4 Little Girls and She's Gotta Have It were each selected by the Library of Congress for preservation in the National Film Registry for being culturally, historically, or aesthetically significant.","Birth":"1957"},"ImagePath":" https://upload.wikimedia.org/wikipedia/en/e/e7/ChiRaqMoviePoster.png","Featured":false}
